app/Http/Controllers/CartController.php

    public function goToCart()
    {
        // return 'item added successfully';
        return view('cart.index',[
            'cartItems' => CartItem::all()->where('cart_id','==',Auth::id()),
            'addres' => Addres::where('user_id','=',Auth::id())->first()
---
select * from `addres` where `user_id` = 1 limit 1