app/Http/Controllers/ProductController.php

    public function index()
    {
        return view('product.index' ,[
            'products' => Product::latest()->filter(request(['search','category']))->paginate(10)->withQueryString()
        ]);
---
select * from `products` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products`